html/posts/2020-03-31--release-cycle-email.org
#+title: Release cycle about SMTP stack
#+date: <2020-03-31 Tue>

If you follow a bit my work, you should know about a huge work started few
months (years?!) ago about the SMTP stack. As a MirageOS developer, I mostly
want to use it to replace some usual services such as a DNS resolver, a blog or
a [[https://hannes.nqsb.io/Posts/DnsServer][primary DNS service]].

But I really would like to replace an old but widely used service, the email
service.

* Mr. MIME at the beginning

One of my biggest project is [[https://github.com/mirage/mrmime][mrmime]]. It's a /little/ library to parse and
generate an email according several RFCs. The most difficult part was to handle
/encoding/ and /multipart/.

This library wants to solve 2 simple problems:
- How to read/introspect an email
- How to generate an email with OCaml

** How to read everything!

An email is easily understandable by a human as a /rich document/ but it can be
hard to extract useful information from it by a computer. Indeed, an email can
be really complex such as a [[https://tools.ietf.org/html/rfc822][RFC822]]'s date or, more obviously who should receive
the email.

Mr. MIME wants to solve this first problem and it provides an [[https://github.com/inhabitedtype/angstrom][angstrom]] parser to
extract /metadata/ and represent them by OCaml values. Then, the user is able to
introspect them and implement something like a /filter/, an organizer, etc.

*** FWS and ~unstrctrd~

The main problem about email is the /folding-whitespace/. It permits the user to
extend a value of a field to multiple lines such as:

#+BEGIN_SRC mail
To: A Group(Some people)
   :Chris Jones <c@(Chris's host.)public.example>,
     joe@example.org,
 John <jdoe@one.test> (my dear friend); (the end of the group)"
#+END_SRC

As long as the next line starts with a /whitespace/, it's a part of the current
value. At the first time, I tried to /parse/ it with ~ocamllex~ but I failed
when I got a ~too big automaton~ error. Then, I switched to ~angstrom~ but I was
not really happy with results.

Recently, with @let-def, we agreed that an ~ocamllex~ still is possible. At the
end, we should be more faster than ~angstrom~. So we did [[https://github.com/mirage/unstrctrd][unstrctrd]]. The project
is a bit more general than emails. In fact, some formats such as some used by
Debian or HTTP/1.1 headers follow the same rule. ~unstrctrd~ wants to /flat/
this kind of value.

Into details, ~unstrctrd~ is a nice mix between ~ocamllex~ and ~angstrom~.

With this project, we handle ~FWS~ described by RFC5322 and obsolete form
described by RFC822. It does some post-processes (like it removes useless
comments as described by ~CFWS~) and provides a well abstracted API to be able
to parse and construct an ~unstructured~ form.

To understand the babel tower, any values available into your email as the date,
email addresses or subject of your email should respect, at least, the
~unstructured~ form. Any of them will be processed, at least, by ~unstrctrd~.

The goal is to hide such complexity to an other lower layer. In fact, before
this library, 2 of mine libraries want to solve this problem:
- [[https://github.com/dinosaure/emile][emile]] to parse email addresses
- and of course, ~mrmime~

To be able to provide as much as possible light libraries, we did ~unstrctrd~
and delete ~FWS~ handler from ~emile~. By that, ~mrmime~ depends on both to
properly parse email addresses.

*** An email address and ~emile~

As you know, we use widely email addresses but the format of them is really
**complex**. We can put more than one domain on it for example (like
~<@gmail.com:romain.calascibetta@x25519.net>~), put a name (which must respect a
special format), use special characters such as ~+~ or spaces with
/quoted-string/. A domain can directly be an IPv4 or IPv6 or an /extensible/
domain locally specified by the SMTP server. You can use UTF-8 of course since
[[https://tools.ietf.org/html/rfc6532][RFC6532]].

In other words, email addresses are [[https://github.com/dinosaure/emile/blob/master/test/test.ml][hard]] to parse.

With ~unstrctrd~, we simplify a bit the library and ~emile~ does not handle
anymore ~FWS~. The goal is to let the user to process the input with ~unstrctrd~
at first if the input comes from an email and then try to parse the result with
~emile~ to extract the email address - and this is what ~mrmime~ does of course.

And, of course, usual user does not care about /folding-whitespace/. The input
comes usually from a form (so, without this such token), so ~emile~ wants to
provide the most easy (and correct) way to parse an email address.

*** UTF-8, UTF-7, latin1 or [[https://en.wikipedia.org/wiki/YUSCII][YUSCII]]?

An other obvious problem about email is the /encoding/ used. We talk sometimes
about /charset/ but let keep /encoding/. Of course, we have several /encoding/
such as ISO-8859. With a nice discussion with @dbuenzli with beers, the most
interesting way to solve the problem about /encoding/ is to arbitrary choose one
and keep it as long as we can.

So, as the [[https://github.com/dbuenzli/uutf][uutf]] author, we chosen UTF-8 of course!

However, we need to provide a way to /normalize/ any /encodings/ to UTF-8. The
Unicode consortium provides some [[ftp://ftp.unicode.org/Public/MAPPINGS/][translation tables]] and I picked them to be able
to translate some of them to UTF-8. Few projects was made in this goal:
- [[https://github.com/mirage/uuuu][uuuu]] to handle ISO-8859 encoding
- [[https://github.com/mirage/coin][coin]] to handle KOI8 encoding
- and the most important, [[https://github.com/mirage/yuscii][yuscii]] to handle [[https://crawshaw.io/blog/utf7][the famous UTF-7 encoding]]

All of them are merged into an other library: [[https://github.com/mirage/rosetta][rosetta]].

This library is used by ~mrmime~ to try to /normalize/ any contents to UTF-8. From
the point of view of the user, he does not need to know all details. The result
is just to say: any contents provided by ~mrmime~ use UTF-8!

An other OCaml project to handle such things exists: [[https://github.com/yoriyuki/Camomile][Camomile]]. But ~rosetta~
wants to be the most easier and simpler as we want.

