html/2020-03-31--release-cycle-email.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://blog.x25519.net/rss.xml"
      title="RSS feed for https://blog.x25519.net/"/>
<title>Release cycle about SMTP stack</title>
<meta  name="author" content="dinosaure" />
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status">
<div class="header">
  <a href="https://blog.x25519.net">dinosaure's Blog</a>
</div></div>
<div id="content">
<div class="headline"> <h1 class="post-title"><a href="2020-03-31--release-cycle-email.html">Release cycle about SMTP stack</a></h1>
</div><div class="post-date"><2020-03-31></div><p>
If you follow a bit my work, you should know about a huge work started few
months (years?!) ago about the SMTP stack. As a MirageOS developer, I mostly
want to use it to replace some usual services such as a DNS resolver, a blog or
a <a href="https://hannes.nqsb.io/Posts/DnsServer">primary DNS service</a>.
</p>

<p>
But I really would like to replace an old but widely used service, the email
service.
</p>

<div id="outline-container-orge5750a8" class="outline-2">
<h2 id="orge5750a8">Mr. MIME at the beginning</h2>
<div class="outline-text-2" id="text-orge5750a8">
<p>
One of my biggest project is <a href="https://github.com/mirage/mrmime">mrmime</a>. It's a <i>little</i> library to parse and
generate an email according several RFCs. The most difficult part was to handle
<i>encoding</i> and <i>multipart</i>.
</p>

<p>
This library wants to solve 2 simple problems:
</p>
<ul class="org-ul">
<li>How to read/introspect an email</li>
<li>How to generate an email with OCaml</li>
</ul>
</div>

<div id="outline-container-org614610e" class="outline-3">
<h3 id="org614610e">How to read everything!</h3>
<div class="outline-text-3" id="text-org614610e">
<p>
An email is easily understandable by a human as a <i>rich document</i> but it can be
hard to extract useful information from it by a computer. Indeed, an email can
be really complex such as a <a href="https://tools.ietf.org/html/rfc822">RFC822</a>'s date or, more obviously who should receive
the email.
</p>

<p>
Mr. MIME wants to solve this first problem and it provides an <a href="https://github.com/inhabitedtype/angstrom">angstrom</a> parser to
extract <i>metadata</i> and represent them by OCaml values. Then, the user is able to
introspect them and implement something like a <i>filter</i>, an organizer, etc.
</p>
</div>

<div id="outline-container-org5b7dc87" class="outline-4">
<h4 id="org5b7dc87">FWS and <code>unstrctrd</code></h4>
<div class="outline-text-4" id="text-org5b7dc87">
<p>
The main problem about email is the <i>folding-whitespace</i>. It permits the user to
extend a value of a field to multiple lines such as:
</p>

<div class="org-src-container">
<pre class="src src-mail"><span class="org-function-name">To:</span> A Group(Some people)
   :Chris Jones &lt;c@(Chris's host.)public.example&gt;,
     joe@example.org,
 John <a href="mailto:jdoe%40one.test">&lt;jdoe@one.test&gt;</a> (my dear friend); (the end of the group)"
</pre>
</div>

<p>
As long as the next line starts with a <i>whitespace</i>, it's a part of the current
value. At the first time, I tried to <i>parse</i> it with <code>ocamllex</code> but I failed
when I got a <code>too big automaton</code> error. Then, I switched to <code>angstrom</code> but I was
not really happy with results.
</p>

<p>
Recently, with @let-def, we agreed that an <code>ocamllex</code> still is possible. At the
end, we should be more faster than <code>angstrom</code>. So we did <a href="https://github.com/mirage/unstrctrd">unstrctrd</a>. The project
is a bit more general than emails. In fact, some formats such as some used by
Debian or HTTP/1.1 headers follow the same rule. <code>unstrctrd</code> wants to <i>flat</i>
this kind of value.
</p>

<p>
Into details, <code>unstrctrd</code> is a nice mix between <code>ocamllex</code> and <code>angstrom</code>.
</p>

<p>
With this project, we handle <code>FWS</code> described by RFC5322 and obsolete form
described by RFC822. It does some post-processes (like it removes useless
comments as described by <code>CFWS</code>) and provides a well abstracted API to be able
to parse and construct an <code>unstructured</code> form.
</p>

<p>
To understand the babel tower, any values available into your email as the date,
email addresses or subject of your email should respect, at least, the
<code>unstructured</code> form. Any of them will be processed, at least, by <code>unstrctrd</code>.
</p>

<p>
The goal is to hide such complexity to an other lower layer. In fact, before
this library, 2 of mine libraries want to solve this problem:
</p>
<ul class="org-ul">
<li><a href="https://github.com/dinosaure/emile">emile</a> to parse email addresses</li>
<li>and of course, <code>mrmime</code></li>
</ul>

<p>
To be able to provide as much as possible light libraries, we did <code>unstrctrd</code>
and delete <code>FWS</code> handler from <code>emile</code>. By that, <code>mrmime</code> depends on both to
properly parse email addresses.
</p>
</div>
</div>

<div id="outline-container-orge0d1bd2" class="outline-4">
<h4 id="orge0d1bd2">An email address and <code>emile</code></h4>
<div class="outline-text-4" id="text-orge0d1bd2">
<p>
As you know, we use widely email addresses but the format of them is really
<b><b>complex</b></b>. We can put more than one domain on it for example (like
<code>&lt;@gmail.com:romain.calascibetta@x25519.net&gt;</code>), put a name (which must respect a
special format), use special characters such as <code>+</code> or spaces with
<i>quoted-string</i>. A domain can directly be an IPv4 or IPv6 or an <i>extensible</i>
domain locally specified by the SMTP server. You can use UTF-8 of course since
<a href="https://tools.ietf.org/html/rfc6532">RFC6532</a>.
</p>

<p>
In other words, email addresses are <a href="https://github.com/dinosaure/emile/blob/master/test/test.ml">hard</a> to parse.
</p>

<p>
With <code>unstrctrd</code>, we simplify a bit the library and <code>emile</code> does not handle
anymore <code>FWS</code>. The goal is to let the user to process the input with <code>unstrctrd</code>
at first if the input comes from an email and then try to parse the result with
<code>emile</code> to extract the email address - and this is what <code>mrmime</code> does of course.
</p>

<p>
And, of course, usual user does not care about <i>folding-whitespace</i>. The input
comes usually from a form (so, without this such token), so <code>emile</code> wants to
provide the most easy (and correct) way to parse an email address.
</p>
</div>
</div>

<div id="outline-container-orgfb2865b" class="outline-4">
<h4 id="orgfb2865b">UTF-8, UTF-7, latin1 or <a href="https://en.wikipedia.org/wiki/YUSCII">YUSCII</a>?</h4>
<div class="outline-text-4" id="text-orgfb2865b">
<p>
An other obvious problem about email is the <i>encoding</i> used. We talk sometimes
about <i>charset</i> but let keep <i>encoding</i>. Of course, we have several <i>encoding</i>
such as ISO-8859. With a nice discussion with @dbuenzli with beers, the most
interesting way to solve the problem about <i>encoding</i> is to arbitrary choose one
and keep it as long as we can.
</p>

<p>
So, as the <a href="https://github.com/dbuenzli/uutf">uutf</a> author, we chosen UTF-8 of course!
</p>

<p>
However, we need to provide a way to <i>normalize</i> any <i>encodings</i> to UTF-8. The
Unicode consortium provides some <a href="ftp://ftp.unicode.org/Public/MAPPINGS/">translation tables</a> and I picked them to be able
to translate some of them to UTF-8. Few projects was made in this goal:
</p>
<ul class="org-ul">
<li><a href="https://github.com/mirage/uuuu">uuuu</a> to handle ISO-8859 encoding</li>
<li><a href="https://github.com/mirage/coin">coin</a> to handle KOI8 encoding</li>
<li>and the most important, <a href="https://github.com/mirage/yuscii">yuscii</a> to handle <a href="https://crawshaw.io/blog/utf7">the famous UTF-7 encoding</a></li>
</ul>

<p>
All of them are merged into an other library: <a href="https://github.com/mirage/rosetta">rosetta</a>.
</p>

<p>
This library is used by <code>mrmime</code> to try to <i>normalize</i> any contents to UTF-8. From
the point of view of the user, he does not need to know all details. The result
is just to say: any contents provided by <code>mrmime</code> use UTF-8!
</p>

<p>
An other OCaml project to handle such things exists: <a href="https://github.com/yoriyuki/Camomile">Camomile</a>. But <code>rosetta</code>
wants to be the most easier and simpler as we want.
</p>
</div>
</div>
