html/posts/2020-03-31--release-cycle-email.org
*** Base64 & Quoted-Printable

~mrmime~ still wants to be low-level. Even if it wants to extract contents, it
does not handle /format/ of contents (this feature should be done by a new other
project [[https://github.com/dinosaure/conan/][conan]] - but we will talk about it in another article).

However, [[https://tools.ietf.org/html/rfc2045][RFC2045]] defines some /standalone/ formats independently to the type of
the content. The most know is the [[https://github.com/mirage/ocaml-base64][base64]] to encode binary or large files into
your email. It's when I discovered that email has his own base64 /format/ that I
decided to deeply [[https://tarides.com/blog/2019-02-08-release-of-base64][update]] the package. decoder of this /special/ format.

In other side, RFC2045 describes an other /format/: the quoted-printable format.
At this time, it was not possible to safely send an UTF-8 email. We still were
constrained to encode each byte of our email into [[https://en.wikipedia.org/wiki/8-bit_clean][7-bits]]. To ensure to be able
to pass 8-bits values, the quoted-printable was done to encode such byte into a
special form.

From that, we did the library [[https://github.com/mirage/pecu][pecu]] which is able to encode and decode such
contents. This library was well tested with [[https://github.com/mirage/pecu/blob/master/fuzz/iso.ml][/fuzzer/]] as we do usually to check
/isomorphism/ between encoder and decoder.

Some others formats exist and are created specially for emails such as the
[[https://tools.ietf.org/html/rfc2646][/flowed/ format]] but they should be handle by others libraries.

** How to generate everything

The major feature about ~mrmime~ is not really about all of these libraries used
to parse an email. Indeed, ~mrmime~ was able to introspect emails at the
beginning (from that, we can look into [[https://www.youtube.com/watch?v=kQkRsNEo25k][an old conference]] about it). The notable
update is the /safe/ way to emit an email.

Indeed, a large work was done about API to be able to properly emit an email and
try to respect as much as we can rules such as:
- /folding-whitespace/
- 80-columns rule
- ~base64~ and quoted-printable encoding
- /multipart/

From that, I think we provide a nice interface to construct and emit an email.
Generation of email address for example is pretty-close to what we expect:

#+BEGIN_SRC ocaml
let me = Local.[ w "romain"; w "calascibetta" ] @ Domain.(domain, [ a "x25519"; a "net" ]) ;;
#+END_SRC

Composition with /parts/ is also nice:

#+BEGIN_SRC ocaml
let content_type_alternative =
  let open Content_type in
  (with_type `Multipart <.> with_subtype (`Iana "alternative")) default

let header =
  Header.empty
  |> Header.add Field_name.content_type (Field.Content, content_type_alternative)

let part0 = Mt.part (stream_of_string "Hello World!")
let part1 = Mt.part (stream_of_string "Salut le monde!")
let m0 = Mt.multipart ~header [ part0; part1; ] |> Mt.multipart_as_part

let m1 = Mt.part stream_of_file
let m = Mt.(make multi (multipart [ m0; m1; ]))
#+END_SRC

Then, ~mrmime~ handles 80 columns such as when it reaches the limit, it tries to
break with a ~FWS~ token the value where is permitted such as:

#+BEGIN_SRC mail
To: thomas@gazagnaire.org, anil@recoil.org, hannes@mehnert.org, gemma.t.gordon@gmail.com
#+END_SRC

becomes:

#+BEGIN_SRC mail
To: thomas@gazagnaire.org, anil@recoil.org, hannes@mehnert.org,
  gemma.t.gordon@gmail.com
#+END_SRC

* SMTP then!

Of course, even if some people are really interested by ~mrmime~ mostly to pave
a way to be able to create yet another email client (in OCaml!), my goal is a
bit offbeat. So I mostly focused on the implementation of a SMTP server.

The first notable library is [[https://github.com/mirage/colombe.git][colombe]] - a low-level implementation of the SMTP
protocol.

