html/2020-03-31--release-cycle-email.html

<div id="outline-container-org03b2c1a" class="outline-4">
<h4 id="org03b2c1a">Base64 &amp; Quoted-Printable</h4>
<div class="outline-text-4" id="text-org03b2c1a">
<p>
<code>mrmime</code> still wants to be low-level. Even if it wants to extract contents, it
does not handle <i>format</i> of contents (this feature should be done by a new other
project <a href="https://github.com/dinosaure/conan/">conan</a> - but we will talk about it in another article).
</p>

<p>
However, <a href="https://tools.ietf.org/html/rfc2045">RFC2045</a> defines some <i>standalone</i> formats independently to the type of
the content. The most know is the <a href="https://github.com/mirage/ocaml-base64">base64</a> to encode binary or large files into
your email. It's when I discovered that email has his own base64 <i>format</i> that I
decided to deeply <a href="https://tarides.com/blog/2019-02-08-release-of-base64">update</a> the package. decoder of this <i>special</i> format.
</p>

<p>
In other side, RFC2045 describes an other <i>format</i>: the quoted-printable format.
At this time, it was not possible to safely send an UTF-8 email. We still were
constrained to encode each byte of our email into <a href="https://en.wikipedia.org/wiki/8-bit_clean">7-bits</a>. To ensure to be able
to pass 8-bits values, the quoted-printable was done to encode such byte into a
special form.
</p>

<p>
From that, we did the library <a href="https://github.com/mirage/pecu">pecu</a> which is able to encode and decode such
contents. This library was well tested with <a href="https://github.com/mirage/pecu/blob/master/fuzz/iso.ml"><i>fuzzer</i></a> as we do usually to check
<i>isomorphism</i> between encoder and decoder.
</p>

<p>
Some others formats exist and are created specially for emails such as the
<a href="https://tools.ietf.org/html/rfc2646"><i>flowed</i> format</a> but they should be handle by others libraries.
</p>
</div>
</div>
</div>

<div id="outline-container-org49b6f34" class="outline-3">
<h3 id="org49b6f34">How to generate everything</h3>
<div class="outline-text-3" id="text-org49b6f34">
<p>
The major feature about <code>mrmime</code> is not really about all of these libraries used
to parse an email. Indeed, <code>mrmime</code> was able to introspect emails at the
beginning (from that, we can look into <a href="https://www.youtube.com/watch?v=kQkRsNEo25k">an old conference</a> about it). The notable
update is the <i>safe</i> way to emit an email.
</p>

<p>
Indeed, a large work was done about API to be able to properly emit an email and
try to respect as much as we can rules such as:
</p>
<ul class="org-ul">
<li><i>folding-whitespace</i></li>
<li>80-columns rule</li>
<li><code>base64</code> and quoted-printable encoding</li>
<li><i>multipart</i></li>
</ul>

<p>
From that, I think we provide a nice interface to construct and emit an email.
Generation of email address for example is pretty-close to what we expect:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">me</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Local.</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">[</span></span> w <span class="org-string">"romain"</span><span class="org-tuareg-font-lock-operator">;</span> w <span class="org-string">"calascibetta"</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">]</span></span> <span class="org-tuareg-font-lock-operator">@</span> <span class="org-tuareg-font-lock-module">Domain.</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>domain<span class="org-tuareg-font-lock-operator">,</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">[</span></span> a <span class="org-string">"x25519"</span><span class="org-tuareg-font-lock-operator">;</span> a <span class="org-string">"net"</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">]</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span> <span class="org-tuareg-font-double-colon">;;</span>
</pre>
</div>

<p>
Composition with <i>parts</i> is also nice:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">content_type_alternative</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">open </span><span class="org-tuareg-font-lock-module">Content_type</span> <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>with_type <span class="org-tuareg-font-lock-constructor">`Multipart</span> <span class="org-tuareg-font-lock-operator">&lt;.&gt;</span> with_subtype <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-tuareg-font-lock-constructor">`Iana</span> <span class="org-string">"alternative"</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span> default

<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">header</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-module">Header.</span>empty
  <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Header.</span>add <span class="org-tuareg-font-lock-module">Field_name.</span>content_type <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-tuareg-font-lock-module">Field.</span><span class="org-tuareg-font-lock-constructor">Content</span><span class="org-tuareg-font-lock-operator">,</span> content_type_alternative<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>

<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">part0</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Mt.</span>part <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>stream_of_string <span class="org-string">"Hello World!"</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">part1</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Mt.</span>part <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>stream_of_string <span class="org-string">"Salut le monde!"</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">m0</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Mt.</span>multipart <span class="org-tuareg-font-lock-operator">~</span>header <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">[</span></span> part0<span class="org-tuareg-font-lock-operator">;</span> part1<span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">]</span></span> <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Mt.</span>multipart_as_part

<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">m1</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Mt.</span>part stream_of_file
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">m</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Mt.</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>make multi <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span>multipart <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">[</span></span> m0<span class="org-tuareg-font-lock-operator">;</span> m1<span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">]</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
Then, <code>mrmime</code> handles 80 columns such as when it reaches the limit, it tries to
break with a <code>FWS</code> token the value where is permitted such as:
</p>

<div class="org-src-container">
<pre class="src src-mail"><span class="org-function-name">To:</span> thomas@gazagnaire.org, anil@recoil.org, hannes@mehnert.org, gemma.t.gordon@gmail.com
</pre>
</div>

<p>
becomes:
</p>

<div class="org-src-container">
<pre class="src src-mail"><span class="org-function-name">To:</span> thomas@gazagnaire.org, anil@recoil.org, hannes@mehnert.org,
  gemma.t.gordon@gmail.com
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7a1bd0b" class="outline-2">
<h2 id="org7a1bd0b">SMTP then!</h2>
<div class="outline-text-2" id="text-org7a1bd0b">
<p>
Of course, even if some people are really interested by <code>mrmime</code> mostly to pave
a way to be able to create yet another email client (in OCaml!), my goal is a
bit offbeat. So I mostly focused on the implementation of a SMTP server.
</p>

<p>
The first notable library is <a href="https://github.com/mirage/colombe.git">colombe</a> - a low-level implementation of the SMTP
protocol.
</p>
</div>
