html/posts/2020-03-31--release-cycle-email.org
** How to describe a state machine?!

The real goal of ~colombe~ is to provide an API which is able to let the user to
describe a state machine to communicate to a peer. By this fact, ~colombe~ does
not want to implement the ~sendmail~ command or does not want to implement a
SMTP relay or a SMTP submission service.

It is the first stone to be able to easily create such programs/libraries.

So most of people should not care about ~colombe~ - as they mostly want to send
an email. However, as a client such as ~sendmail~ or as a server such as an SMTP
submission service, they should use the same ground and avoid a duplicate an
implementation of how to talk SMTP with a peer.

Another point is the possibility to use ~colombe~ with MirageOS - and make an
unikernel with it. From that, we started to use an other kind of abstraction of
I/O (such as [[https://github.com/ocsigen/lwt][LWT]] or [[https://github.com/janestreet/async][ASYNC]] - or ~Unix~) which uses less /functor/ as we do
usually with MirageOS.

But the real good point of ~colombe~ is the ability to describe the state
machine with /monad/ which provides high-level ~recv~ and ~send~ operations:

#+BEGIN_SRC ocaml
let properly_quit_and_fail ctx err =
  let* _txts = send ctx QUIT () >>= fun () -> recv ctx PP_221 in
  fail err

let authentication ctx username password =
  let* code, txts = send ctx AUTH PLAIN >>= fun () -> recv ctx CODE in
  match code with
  | 504 -> properly_quit_and_fail ctx `Unsupported_mechanism
  | 538 -> properly_quit_and_fail ctx `Encryption_required
  | 534 -> properly_quit_and_fail ctx `Weak_mechanism
  | 334 ->
    let* () = match txts with
      | [] ->
        let payload = Base64.encode_exn (Fmt.strf "\000%s\000%s" username password) in
        send ctx PAYLOAD payload
      | x :: _ ->
        let x = Base64.decode_exn x in
        let payload = Base64.encode_exn (Fmt.strf "%s\000%s\000%s" x username password) in
        send ctx PAYLOAD payload in
    ( recv ctx CODE >>= function
        | (235, _txts) -> return `Authenticated
        | (501, _txts) -> properly_quit_and_fail ctx `Authentication_rejected
        | (535, _txts) -> properly_quit_and_fail ctx `Authentication_failed
        | (code, txts) -> fail (`Unexpected_response (code, txts)) )
  | code -> fail (`Unexpected_response (code, txts))
#+END_SRC

As you can see, we use [[https://jobjo.github.io/2019/04/24/ocaml-has-some-new-shiny-syntax.html][monadic operators]] to simplify the lecture of the code.
~send~ and ~recv~ take values described by the user with a GADT:

#+BEGIN_SRC ocaml
type 'x send =
  | QUIT : unit send
  | AUTH : auth send
  | PAYLOAD : string send

type 'x recv =
  | PP_220 : string list recv
  | PP_221 : string list recv
  | CODE : (int * string list) recv
#+END_SRC

Then, the user just needs to describe how to process such commands with a given ~ctx~:
- how to /send/ ~'x recv~ to the ~ctx~
- how to /recv/ ~'x send~ from the ~ctx~

Of course, this where ~colombe~ comes. It already defines few /primitives/ to
emit and parse such commands into the ~ctx~.

At another layer (which needs /syscalls/), a composition between the ~ctx~ and a
~fiber~ (like ~authentication~) returns a process ~t~ such as:

#+BEGIN_SRC ocaml
type ('a, 'err) t =
  | Read   of { buffer : bytes
              ; off : int
              ; len : int
              ; k : int -> ('a, 'err) t }
  | Write  of { buffer : string
              ; off : int
              ; len : int
              ; k : int -> ('a, 'err) t }
  | Return of 'a
  | Fail   of 'err

let run socket username password =
  let ctx = Context.create () in
  let fiber = authentication ctx username password in

  let rec go = function
    | Read { buffer; off; len; k; } ->
      let len = Unix.read socket buffer off len in
      go (k len)
    | Write { buffer; off; len; k; } ->
      let len = Unix.write socket buffer off len in
      go (k len)
    | Return v -> Ok v
    | Fail err -> Error err in
  go m
#+END_SRC

And you have a fully implemented and available way on ~Unix~ to communication with a SMTP
peer - and be authenticated.

