html/2020-03-31--release-cycle-email.html

<div id="outline-container-orge1a46fe" class="outline-3">
<h3 id="orge1a46fe">How to describe a state machine?!</h3>
<div class="outline-text-3" id="text-orge1a46fe">
<p>
The real goal of <code>colombe</code> is to provide an API which is able to let the user to
describe a state machine to communicate to a peer. By this fact, <code>colombe</code> does
not want to implement the <code>sendmail</code> command or does not want to implement a
SMTP relay or a SMTP submission service.
</p>

<p>
It is the first stone to be able to easily create such programs/libraries.
</p>

<p>
So most of people should not care about <code>colombe</code> - as they mostly want to send
an email. However, as a client such as <code>sendmail</code> or as a server such as an SMTP
submission service, they should use the same ground and avoid a duplicate an
implementation of how to talk SMTP with a peer.
</p>

<p>
Another point is the possibility to use <code>colombe</code> with MirageOS - and make an
unikernel with it. From that, we started to use an other kind of abstraction of
I/O (such as <a href="https://github.com/ocsigen/lwt">LWT</a> or <a href="https://github.com/janestreet/async">ASYNC</a> - or <code>Unix</code>) which uses less <i>functor</i> as we do
usually with MirageOS.
</p>

<p>
But the real good point of <code>colombe</code> is the ability to describe the state
machine with <i>monad</i> which provides high-level <code>recv</code> and <code>send</code> operations:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">properly_quit_and_fail</span><span class="org-variable-name"> ctx err</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-governing">let</span><span class="org-tuareg-font-lock-operator">*</span> _txts <span class="org-tuareg-font-lock-operator">=</span> send ctx <span class="org-tuareg-font-lock-constructor">QUIT</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">()</span></span> <span class="org-tuareg-font-lock-operator">&gt;&gt;=</span> <span class="org-keyword">fun</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">()</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span> recv ctx <span class="org-tuareg-font-lock-constructor">PP_221</span> <span class="org-tuareg-font-lock-governing">in</span>
  fail err

<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">authentication</span><span class="org-variable-name"> ctx username password</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-governing">let</span><span class="org-tuareg-font-lock-operator">*</span> code<span class="org-tuareg-font-lock-operator">,</span> txts <span class="org-tuareg-font-lock-operator">=</span> send ctx <span class="org-tuareg-font-lock-constructor">AUTH</span> <span class="org-tuareg-font-lock-constructor">PLAIN</span> <span class="org-tuareg-font-lock-operator">&gt;&gt;=</span> <span class="org-keyword">fun</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">()</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span> recv ctx <span class="org-tuareg-font-lock-constructor">CODE</span> <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-keyword">match</span> code <span class="org-keyword">with</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-highlight-numbers-number">504</span> <span class="org-tuareg-font-lock-operator">-&gt;</span> properly_quit_and_fail ctx <span class="org-tuareg-font-lock-constructor">`Unsupported_mechanism</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-highlight-numbers-number">538</span> <span class="org-tuareg-font-lock-operator">-&gt;</span> properly_quit_and_fail ctx <span class="org-tuareg-font-lock-constructor">`Encryption_required</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-highlight-numbers-number">534</span> <span class="org-tuareg-font-lock-operator">-&gt;</span> properly_quit_and_fail ctx <span class="org-tuareg-font-lock-constructor">`Weak_mechanism</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-highlight-numbers-number">334</span> <span class="org-tuareg-font-lock-operator">-&gt;</span>
    <span class="org-tuareg-font-lock-governing">let</span><span class="org-tuareg-font-lock-operator">*</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">()</span></span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-keyword">match</span> txts <span class="org-keyword">with</span>
      <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">[]</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span>
        <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">payload</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Base64.</span>encode_exn <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-tuareg-font-lock-module">Fmt.</span>strf <span class="org-string">"\000%s\000%s"</span> username password<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span> <span class="org-tuareg-font-lock-governing">in</span>
        send ctx <span class="org-tuareg-font-lock-constructor">PAYLOAD</span> payload
      <span class="org-tuareg-font-lock-operator">|</span> x <span class="org-tuareg-font-lock-operator">::</span> _ <span class="org-tuareg-font-lock-operator">-&gt;</span>
        <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">x</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Base64.</span>decode_exn x <span class="org-tuareg-font-lock-governing">in</span>
        <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">payload</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Base64.</span>encode_exn <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-tuareg-font-lock-module">Fmt.</span>strf <span class="org-string">"%s\000%s\000%s"</span> x username password<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span> <span class="org-tuareg-font-lock-governing">in</span>
        send ctx <span class="org-tuareg-font-lock-constructor">PAYLOAD</span> payload <span class="org-tuareg-font-lock-governing">in</span>
    <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span> recv ctx <span class="org-tuareg-font-lock-constructor">CODE</span> <span class="org-tuareg-font-lock-operator">&gt;&gt;=</span> <span class="org-keyword">function</span>
        <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-highlight-numbers-number">235</span><span class="org-tuareg-font-lock-operator">,</span> _txts<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span> return <span class="org-tuareg-font-lock-constructor">`Authenticated</span>
        <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-highlight-numbers-number">501</span><span class="org-tuareg-font-lock-operator">,</span> _txts<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span> properly_quit_and_fail ctx <span class="org-tuareg-font-lock-constructor">`Authentication_rejected</span>
        <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-highlight-numbers-number">535</span><span class="org-tuareg-font-lock-operator">,</span> _txts<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span> properly_quit_and_fail ctx <span class="org-tuareg-font-lock-constructor">`Authentication_failed</span>
        <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span>code<span class="org-tuareg-font-lock-operator">,</span> txts<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span> fail <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-tuareg-font-lock-constructor">`Unexpected_response</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>code<span class="org-tuareg-font-lock-operator">,</span> txts<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
  <span class="org-tuareg-font-lock-operator">|</span> code <span class="org-tuareg-font-lock-operator">-&gt;</span> fail <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-tuareg-font-lock-constructor">`Unexpected_response</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span>code<span class="org-tuareg-font-lock-operator">,</span> txts<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
</pre>
</div>

<p>
As you can see, we use <a href="https://jobjo.github.io/2019/04/24/ocaml-has-some-new-shiny-syntax.html">monadic operators</a> to simplify the lecture of the code.
<code>send</code> and <code>recv</code> take values described by the user with a GADT:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">type</span> <span class="org-type">'x send</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">QUIT</span> <span class="org-tuareg-font-lock-operator">:</span> unit send
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">AUTH</span> <span class="org-tuareg-font-lock-operator">:</span> auth send
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">PAYLOAD</span> <span class="org-tuareg-font-lock-operator">:</span> string send

<span class="org-tuareg-font-lock-governing">type</span> <span class="org-type">'x recv</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">PP_220</span> <span class="org-tuareg-font-lock-operator">:</span> string list recv
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">PP_221</span> <span class="org-tuareg-font-lock-operator">:</span> string list recv
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">CODE</span> <span class="org-tuareg-font-lock-operator">:</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>int <span class="org-tuareg-font-lock-operator">*</span> string list<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span> recv
</pre>
</div>

<p>
Then, the user just needs to describe how to process such commands with a given <code>ctx</code>:
</p>
<ul class="org-ul">
<li>how to <i>send</i> <code>'x recv</code> to the <code>ctx</code></li>
<li>how to <i>recv</i> <code>'x send</code> from the <code>ctx</code></li>
</ul>

<p>
Of course, this where <code>colombe</code> comes. It already defines few <i>primitives</i> to
emit and parse such commands into the <code>ctx</code>.
</p>

<p>
At another layer (which needs <i>syscalls</i>), a composition between the <code>ctx</code> and a
<code>fiber</code> (like <code>authentication</code>) returns a process <code>t</code> such as:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">type</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-type">'a</span><span class="org-tuareg-font-lock-operator">,</span><span class="org-type"> 'err</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span><span class="org-type"> t</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Read</span>   <span class="org-keyword">of</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span> buffer <span class="org-tuareg-font-lock-operator">:</span> bytes
              <span class="org-tuareg-font-lock-operator">;</span> off <span class="org-tuareg-font-lock-operator">:</span> int
              <span class="org-tuareg-font-lock-operator">;</span> len <span class="org-tuareg-font-lock-operator">:</span> int
              <span class="org-tuareg-font-lock-operator">;</span> k <span class="org-tuareg-font-lock-operator">:</span> int <span class="org-tuareg-font-lock-operator">-&gt;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span>'a<span class="org-tuareg-font-lock-operator">,</span> 'err<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> t <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Write</span>  <span class="org-keyword">of</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span> buffer <span class="org-tuareg-font-lock-operator">:</span> string
              <span class="org-tuareg-font-lock-operator">;</span> off <span class="org-tuareg-font-lock-operator">:</span> int
              <span class="org-tuareg-font-lock-operator">;</span> len <span class="org-tuareg-font-lock-operator">:</span> int
              <span class="org-tuareg-font-lock-operator">;</span> k <span class="org-tuareg-font-lock-operator">:</span> int <span class="org-tuareg-font-lock-operator">-&gt;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span>'a<span class="org-tuareg-font-lock-operator">,</span> 'err<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> t <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Return</span> <span class="org-keyword">of</span> 'a
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Fail</span>   <span class="org-keyword">of</span> 'err

<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">run</span><span class="org-variable-name"> socket username password</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">ctx</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Context.</span>create <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">()</span></span> <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">fiber</span> <span class="org-tuareg-font-lock-operator">=</span> authentication ctx username password <span class="org-tuareg-font-lock-governing">in</span>

  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">go</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-keyword">function</span>
    <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Read</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span> buffer<span class="org-tuareg-font-lock-operator">;</span> off<span class="org-tuareg-font-lock-operator">;</span> len<span class="org-tuareg-font-lock-operator">;</span> k<span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span>
      <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">len</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Unix.</span>read socket buffer off len <span class="org-tuareg-font-lock-governing">in</span>
      go <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>k len<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
    <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Write</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span> buffer<span class="org-tuareg-font-lock-operator">;</span> off<span class="org-tuareg-font-lock-operator">;</span> len<span class="org-tuareg-font-lock-operator">;</span> k<span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span> <span class="org-tuareg-font-lock-operator">-&gt;</span>
      <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">len</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Unix.</span>write socket buffer off len <span class="org-tuareg-font-lock-governing">in</span>
      go <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>k len<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
    <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Return</span> v <span class="org-tuareg-font-lock-operator">-&gt;</span> <span class="org-tuareg-font-lock-constructor">Ok</span> v
    <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Fail</span> err <span class="org-tuareg-font-lock-operator">-&gt;</span> <span class="org-tuareg-font-lock-constructor">Error</span> err <span class="org-tuareg-font-lock-governing">in</span>
  go m
</pre>
</div>

<p>
And you have a fully implemented and available way on <code>Unix</code> to communication with a SMTP
peer - and be authenticated.
</p>
</div>
</div>
