html/posts/2020-03-31--release-cycle-email.org
** Implement ~sendmail~, the client side

At least, from this core, it should be easy to implement ~sendmail~ command. And
of course, the distribution of ~colombe~ provide such library:
- ~sendmail~ which is free about lwt, async or unix
- ~sendmail.tls~ which uses ~STARTTLS~
- ~sendmail-lwt~ a specialisation of ~sendmail~ with lwt

All of them wants to provide the most easy way to send an email. Indeed, it
exists 2 ways to submit an email:
- over a TLS flow available on ~*:465~
- over a simple TCP flow but mostly of them require to start a TLS flow
  /in-the-fly/ on ~*:587~ with ~STARTTLS~

*** ~facteur~

From all of that, we developed a little /proof-of-concept/ to see if ~colombe~
and ~sendmail~ correspond to what we expect: [[https://github.com/dinosaure/facteur/][facteur]].

This is a simple tool which wants to send an email as the ~sendmail~ command but
the complete stack is in OCaml! It's a merge of ~mrmime~ and ~sendmail~ to be
able to produce a well formed email with file attachments.

It still is an experimental software and it requires a bad dependency [[https://linux.die.net/man/5/magic][libmagic]]
to be able to recognise MIME type of file attachments. However, I started to
implement something else, [[https://github.com/dinosaure/conan.git][conan]], to automatically do this job and be MirageOS
compatible.

** Server side

Finally, I started to implement the server side. ~colombe~ handles both side. It
can parse response and emit request and /vice-versa/. From the same ground, we
try to implement 2 servers into a single project: [[https://github.com/dinosaure/ptt][ptt]].

It provides two libraries:
- ~lipap~ which is an SMTP submission server
- ~mti-gf~ which is an SMTP relay server

The final goal of them is to provide a full stack to be able to create email
addresses from a given domain. An example is may be more interesting, we will
take my ~x25519.net~.

We will provide a first SMTP relay which will receive any incoming emails. It
will be the server notified by my primary DNS server with the ~MX~ record.

#+BEGIN_SRC shell
$ dig +short MX x25519.net
0 163.172.65.89
#+END_SRC

The goal of it is to transmit incoming email to the real destination. For
example, you want to send me an email to ~romain@x25519.net~ from your
~gmail.com~ address. Google will speak with this server. Internally, I
associated ~romain@x25519.net~ to ~romain.calascibetta@gmail.com~. Finally,
~mti-gf~ will /retransmit/ your email to Google (to
~romain.calascibetta@gmail.com~).

The second server let us to use our ~x25519.net~ email address to send email.
The goal is to properly configure your [[https://fr.wikipedia.org/wiki/Mail_Transfer_Agent][MUA]] to be able to be authenticated to our
~lipap~ server. Then, it is able to communicate to others SMTP servers such as
Google and send your email to them (with your ~x25519.net~ address).

So from my experiments, all should work and I started to deploy some others
unikernels mostly to get automatically [[https://letsencrypt.org/][let's encrypt]] certificates - and provide
~163.172.65.89:587~ and ~163.172.65.89:465~.

** Other projects

Along my way, I surely developed some others tools (which need an update with
new interfaces or are really experimental) such as:
- [[https://github.com/dinosaure/ocaml-dkim][ocaml-dkim]] to verify DKIM fields from an email
- [[https://github.com/mirage/colombe][received]] to generate a graph from ~Received:~ fields from an email or generate
  one of them

* Conclusion

The stack is huge and it is not really finished. But I believe that I reached a
point where all libraries compose nicely and let me to provide something much
more complex such as an SMTP server!

All of that is possible of course with the work from others peoples such as
[[https://github.com/mirleft/ocaml-tls][ocaml-tls]] or, more generally, MirageOS people.

I believe that this year will be the year where such service will be exist as a
MirageOS unikernel! And may be do an anarchist revolution and do a self
re-appropriation of the means of production.
