html/2020-03-31--release-cycle-email.html

<div id="outline-container-org5acd35a" class="outline-3">
<h3 id="org5acd35a">Implement <code>sendmail</code>, the client side</h3>
<div class="outline-text-3" id="text-org5acd35a">
<p>
At least, from this core, it should be easy to implement <code>sendmail</code> command. And
of course, the distribution of <code>colombe</code> provide such library:
</p>
<ul class="org-ul">
<li><code>sendmail</code> which is free about lwt, async or unix</li>
<li><code>sendmail.tls</code> which uses <code>STARTTLS</code></li>
<li><code>sendmail-lwt</code> a specialisation of <code>sendmail</code> with lwt</li>
</ul>

<p>
All of them wants to provide the most easy way to send an email. Indeed, it
exists 2 ways to submit an email:
</p>
<ul class="org-ul">
<li>over a TLS flow available on <code>*:465</code></li>
<li>over a simple TCP flow but mostly of them require to start a TLS flow
<i>in-the-fly</i> on <code>*:587</code> with <code>STARTTLS</code></li>
</ul>
</div>

<div id="outline-container-org5066893" class="outline-4">
<h4 id="org5066893"><code>facteur</code></h4>
<div class="outline-text-4" id="text-org5066893">
<p>
From all of that, we developed a little <i>proof-of-concept</i> to see if <code>colombe</code>
and <code>sendmail</code> correspond to what we expect: <a href="https://github.com/dinosaure/facteur/">facteur</a>.
</p>

<p>
This is a simple tool which wants to send an email as the <code>sendmail</code> command but
the complete stack is in OCaml! It's a merge of <code>mrmime</code> and <code>sendmail</code> to be
able to produce a well formed email with file attachments.
</p>

<p>
It still is an experimental software and it requires a bad dependency <a href="https://linux.die.net/man/5/magic">libmagic</a>
to be able to recognise MIME type of file attachments. However, I started to
implement something else, <a href="https://github.com/dinosaure/conan.git">conan</a>, to automatically do this job and be MirageOS
compatible.
</p>
</div>
</div>
</div>

<div id="outline-container-org73a4aa8" class="outline-3">
<h3 id="org73a4aa8">Server side</h3>
<div class="outline-text-3" id="text-org73a4aa8">
<p>
Finally, I started to implement the server side. <code>colombe</code> handles both side. It
can parse response and emit request and <i>vice-versa</i>. From the same ground, we
try to implement 2 servers into a single project: <a href="https://github.com/dinosaure/ptt">ptt</a>.
</p>

<p>
It provides two libraries:
</p>
<ul class="org-ul">
<li><code>lipap</code> which is an SMTP submission server</li>
<li><code>mti-gf</code> which is an SMTP relay server</li>
</ul>

<p>
The final goal of them is to provide a full stack to be able to create email
addresses from a given domain. An example is may be more interesting, we will
take my <code>x25519.net</code>.
</p>

<p>
We will provide a first SMTP relay which will receive any incoming emails. It
will be the server notified by my primary DNS server with the <code>MX</code> record.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ dig +short MX x25519.net
<span class="org-highlight-numbers-number">0</span> <span class="org-highlight-numbers-number">163.172.65.89</span>
</pre>
</div>

<p>
The goal of it is to transmit incoming email to the real destination. For
example, you want to send me an email to <code>romain@x25519.net</code> from your
<code>gmail.com</code> address. Google will speak with this server. Internally, I
associated <code>romain@x25519.net</code> to <code>romain.calascibetta@gmail.com</code>. Finally,
<code>mti-gf</code> will <i>retransmit</i> your email to Google (to
<code>romain.calascibetta@gmail.com</code>).
</p>

<p>
The second server let us to use our <code>x25519.net</code> email address to send email.
The goal is to properly configure your <a href="https://fr.wikipedia.org/wiki/Mail_Transfer_Agent">MUA</a> to be able to be authenticated to our
<code>lipap</code> server. Then, it is able to communicate to others SMTP servers such as
Google and send your email to them (with your <code>x25519.net</code> address).
</p>

<p>
So from my experiments, all should work and I started to deploy some others
unikernels mostly to get automatically <a href="https://letsencrypt.org/">let's encrypt</a> certificates - and provide
<code>163.172.65.89:587</code> and <code>163.172.65.89:465</code>.
</p>
</div>
</div>

<div id="outline-container-orgb03bf0a" class="outline-3">
<h3 id="orgb03bf0a">Other projects</h3>
<div class="outline-text-3" id="text-orgb03bf0a">
<p>
Along my way, I surely developed some others tools (which need an update with
new interfaces or are really experimental) such as:
</p>
<ul class="org-ul">
<li><a href="https://github.com/dinosaure/ocaml-dkim">ocaml-dkim</a> to verify DKIM fields from an email</li>
<li><a href="https://github.com/mirage/colombe">received</a> to generate a graph from <code>Received:</code> fields from an email or generate
one of them</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd32830a" class="outline-2">
<h2 id="orgd32830a">Conclusion</h2>
<div class="outline-text-2" id="text-orgd32830a">
<p>
The stack is huge and it is not really finished. But I believe that I reached a
point where all libraries compose nicely and let me to provide something much
more complex such as an SMTP server!
</p>

<p>
All of that is possible of course with the work from others peoples such as
<a href="https://github.com/mirleft/ocaml-tls">ocaml-tls</a> or, more generally, MirageOS people.
</p>

<p>
I believe that this year will be the year where such service will be exist as a
MirageOS unikernel! And may be do an anarchist revolution and do a self
re-appropriation of the means of production.
</p>
</div>
</div>
</div>
<div id="postamble" class="status"><div id="archive">
  <a href="archive.html">archive</a>
</div></div>
</body>
</html>
